In [5]:
import networkx
import pandas as pd
import os
import re

## Database creation:
Source : [Github link for source](https://github.com/dr5hn/countries-states-cities-database/blob/master/csv/countries.csv): considering these as the officially recognised Countries    
Imported CSVs in CSV/Imported   
The CSVs after cleaning in CSV/Used

In [6]:
df = pd.read_csv("CSV/Imported/countries.csv",usecols=["name"])
df

                          name
0                  Afghanistan
1                Aland Islands
2                      Albania
3                      Algeria
4               American Samoa
..                         ...
245  Wallis and Futuna Islands
246             Western Sahara
247                      Yemen
248                     Zambia
249                   Zimbabwe

[250 rows x 1 columns]

In [15]:
def clean_country_name(parameter):
    parameter.strip()
    parameter = re.sub(r'\s*\(.*?\)', '', parameter)  # Remove bracketed content
    parameter = re.sub(r'\s*S\.A\.R.$', '', parameter, flags=re.IGNORECASE)  # Remove 'S.A.R' at the end
    return parameter.strip()  # Trim spaces

# Apply the function
df['name'] = df['name'].apply(clean_country_name)
df.drop_duplicates()

                          name
0                  Afghanistan
1                Aland Islands
2                      Albania
3                      Algeria
4               American Samoa
..                         ...
245  Wallis and Futuna Islands
246             Western Sahara
247                      Yemen
248                     Zambia
249                   Zimbabwe

[249 rows x 1 columns]

In [16]:
os.makedirs("CSV/Used",exist_ok=True)
df.to_csv("CSV/Used/countries.csv")

## Database 2

Used the database from: [Link](https://simplemaps.com/data/world-cities)  
Stored result in CSV/Used/Cities

In [41]:
df2 = pd.read_csv("CSV/Imported/worldcities.csv",usecols=["city","population"])
df2

                   city  population
0                 Tokyo  37732000.0
1               Jakarta  33756000.0
2                 Delhi  32226000.0
3             Guangzhou  26940000.0
4                Mumbai  24973000.0
...                 ...         ...
47863        Munha-dong         NaN
47864            Sil-li         NaN
47865              Muan         NaN
47866         Hongseong         NaN
47867  Charlotte Amalie         NaN

[47868 rows x 2 columns]

In [42]:
df2 = df2.sort_values(by="population", ascending=False)

# Select the first 500 rows and rename 'city' to 'name' while dropping 'population'
df2 = df2.head(500).rename(columns={"city": "name"}).drop(columns=["population"])

# Check the result
df2['name'].apply(clean_country_name) # S.A.R. wont be used, but trimming is good anyways
df2

          name
0        Tokyo
1      Jakarta
2        Delhi
3    Guangzhou
4       Mumbai
..         ...
495     Puebla
496   Columbus
497   Yopougon
498       Hebi
499     Shīrāz

[500 rows x 1 columns]

In [43]:
os.makedirs("CSV/Used",exist_ok=True)
df2.to_csv("CSV/Used/cities.csv")

We have already renamed df2's column to match the column name "name" of df1, so we can easily concat them now

In [44]:
df3 = pd.concat([df,df2],axis=0,ignore_index=True)

In [45]:
df3

               name
0       Afghanistan
1     Aland Islands
2           Albania
3           Algeria
4    American Samoa
..              ...
745          Puebla
746        Columbus
747        Yopougon
748            Hebi
749          Shīrāz

[750 rows x 1 columns]

In [46]:
os.makedirs("CSV/Used",exist_ok=True)
df3.to_csv("CSV/Used/db3.csv")